package com.nanxinda.tree.binarytree.threadbinarytree;

public class ArrayAndLinkedListAndTreeCompare {
    /*
    1）数组
    优点：通过下标方式访问元素，速度快。对于有序数组，还可以使用二分法查找提高检索速度
    缺点：如果要检索具体某个值，或者插入值（按一定顺序）会整体移动，效率较低
    2）链表
    优点：在一定程度上对数组存储方式有优化（删除，添加）
    缺点：在进行检索时，效率较低（从头节点开始）
    3）树
    能提高存储、读取的效率（二叉排序树），既可以保证数据的检索速度，同时也可以保证
    数据的检索速度，同时也可以保证数据的插入、删除、修改速度
     */
    /*
    二叉树
    1.每个节点最多只能有两个子节点的一种形式成为二叉树
    2.二叉树的子节点分为左节点和右节点
    3.如果该二叉树的所有叶子节点都在最后一层，并且节点总数=2^n-1，n为层数，则我们称为
    满二叉树
    4.如果该二叉树的所有叶子节点都在最后一层或者倒数第二层，而且最后一层的叶子节点
    在左边连续，倒数第二层的叶子节点在右边连续，称为完全二叉树
     */
}
