package com.nanxinda.sql;

public class SQL {
    /// MySQL数据库连接客户端：mysql -u root -p
    /*
      MySQL数据库
      1.关系型数据库
      概念：建立在关系模型基础上，由多张相互连接的二维表组成的数据库
      特点：1）使用表存储数据，格式统一，便于维护 2）使用SQL语言操作，标准统一，使用方便
      SQL通用语法：
      1.SQL语句可以单行或多行书写，以分号结尾
      2.SQL语句可以使用空格/缩进来增强语句的可读性
      3.MySQL数据库的SQL语句不区分大小写，关键字建议使用大写
      4.注释：
      单行注释：--注释内容 或#注释内容（MySQL特有）
      多行注释："/*注释内容*/
    /*
    DDL:数据库定义语句，用来定义数据库对象（数据库，表，字段）
    DML：数据操作语言，用来对数据库表中的数据进行增删改
    DQL：数据查询语句，用来查询数据库中表的记录
    DCL：数据控制语句，用来创建数据库用户、控制数据库的访问权限
     */
}
